#+TITLE: TODO LIST
* Experience
** print on paper to use shortcuts
** _remember to save all files before restart computer_
* Recently need to do

** DONE use shell to change VPN on/off in Ubuntu
CLOSED: [2016-09-04 Sun 18:09]
sloved git not work through VPN, add http proxy in config file
[http]
	proxy = socks5://127.0.0.1:1080
[https]
	proxy = socks5://127.0.0.1:1080
** DONE Ubuntu no sound issue
CLOSED: [2016-09-04 Sun 14:19]
:LOGBOOK:
CLOCK: [2016-09-04 Sun 13:50]--[2016-09-04 Sun 14:19] =>  0:29
:END:

** DONE download dropbox in Ubuntu for synchronize org files
CLOSED: [2016-09-04 Sun 13:52]
install dropbox successfully, but mobile org is not good to use, so...
*** install Dropbox from Ubuntu Software Centre

*** ” Dropbox needs proprietary daemon ” solution
1) Download the daemon tool provided by the Dropbox
32bit: http://www.dropbox.com/download?plat=lnx.x86
64bit: http://www.dropbox.com/download?plat=lnx.x86_64
2)extract the files to home folder etc
note : the extracted files fare hidden so press cntrl + h to view them
3)Thirdly, use your shell to call the Dropbox daemon:
/home/user/.dropbox-dist/dropboxd
After you created your account, and linked your computer to the Dropbox account, you find a ne folder in your home directory named Dropbox. This is your sync folder.

*** dropbox proxy setting
socks5 local:127.0.0.1 1080
** DONE install eclipse on ubuntu to find out how to debug program
:LOGBOOK:
CLOCK: [2016-09-04 Sun 18:14]--[2016-09-04 Sun 20:41] =>  2:27
:END:

because I don't know how to debug on smartest and what's the theory
*** download jdk-8u101-linux-x64.tar.gz from oracle website
*** download eclipse-inst-linux64.tar.gz from eclipse.org
*** install jdk
http://askubuntu.com/questions/56104/how-can-i-install-sun-oracles-proprietary-java-jdk-6-7-8-or-jre
*** install eclipse
http://askubuntu.com/questions/26632/how-to-install-eclipse/145018#145018
*** wait .......................
*** sudo apt install openjdk-8-jre-headless
*** sudo apt install eclipse-cdt
*** done!
** DONE study manage dot file, 
CLOSED: [2016-10-26 Wed 15:00]
** TODO and learn shell script
** DONE intall source code pro
CLOSED: [2016-10-03 Mon 07:39]
git clone --depth 1 --branch release https://github.com/adobe-fonts/source-code-pro.git ~/.fonts/adobe-fonts/source-code-pro
fc-cache -f -v ~/.fonts/adobe-fonts/source-code-pro
** DONE Ubuntu caps lock to ctrl
CLOSED: [2016-10-03 Mon 11:24]
sudo apt-get install gnome-tweak-tool

Open tweak-tool and click on the typing section in the left column.
You should now see the line Caps Lock key behavior on the left.
Choose Make Caps Lock an additionnal Ctrl key instead of Disabled in the drop down list and you should be good.
* Editor tips
** vim/nvim
*** :set textwidth=80 can reformat highlight lines with gq.
*** :let mapleader = "\<Space>" is great
*** au BufRead * normal zi #open files with no fold
** emacs/spacemacs
*** DONE spacemacs how to map jj to Esc
CLOSED: [2016-10-03 Mon 07:38]
**** way 1

   dotspacemacs-additional-packages '(
                                      key-chord
                                      )

  (require 'key-chord)
  (key-chord-mode 1)
  ;;(setq key-chord-two-keys-delay 0.5)
  ;;(key-chord-define evil-insert-state-map "jj" 'evil-normal-state)
  (key-chord-define evil-hybrid-state-map "jj" 'evil-normal-state)
  
**** way 2
(defun dotspacemacs/user-config ()
  (setq-default evil-escape-key-sequence "jj"))
* Eclipse
** vim plugin http://vrapper.sourceforge.net/update-stie/stable
* Linux & Ubuntu
** Useful tools in Ubuntu
*** GoldenDict
*** gnome-tweak-tool
** server part of vbird's blog
:LOGBOOK:
CLOCK: [2016-04-12 Tue 16:23]--[2016-04-12 Tue 18:23] =>  2:00
CLOCK: [2016-02-29 Mon 16:56]--[2016-02-29 Mon 17:27] =>  0:31
:END:

* C++ Primer
#+BEGIN: clocktable :maxlevel 2 :scope subtree
#+CAPTION: Clock summary at [2016-04-18 Mon 09:30]
| Headline                            | Time    |       |
|-------------------------------------+---------+-------|
| *Total time*                        | *19:59* |       |
|-------------------------------------+---------+-------|
| C++ Primer                          | 19:59   |       |
| \_  3.2                             |         |  2:00 |
| \_  3.5                             |         |  1:36 |
| \_  4 expressions                   |         |  1:02 |
| \_  4.4. Assignment Operators       |         |  2:35 |
| \_  4.6 the member access operators |         |  0:01 |
| \_  6.0 function                    |         |  0:36 |
| \_  6.4                             |         |  1:17 |
| \_  6.6 function matching           |         |  0:42 |
| \_  TODO 7.5 class                  |         | 10:10 |
#+END:

** 3.2
:LOGBOOK:
CLOCK: [2016-03-10 Thu 15:18]--[2016-03-10 Thu 17:18] =>  2:00
:END:
** 3.5
:LOGBOOK:
CLOCK: [2016-03-14 Mon 16:33]--[2016-03-14 Mon 18:09] =>  1:36
:END:
** 4 expressions
:LOGBOOK:
CLOCK: [2016-03-15 Tue 15:58]--[2016-03-15 Tue 17:00] =>  1:02
:END:
** 4.4. Assignment Operators
:LOGBOOK:
CLOCK: [2016-03-16 Wed 15:17]--[2016-03-16 Wed 17:52] =>  2:35
:END:
** 4.6 the member access operators
:LOGBOOK:
CLOCK: [2016-03-17 Thu 17:54]--[2016-03-17 Thu 17:55] =>  0:01
:END:
** 5.0 statements 
** 6.0 function
:LOGBOOK:
CLOCK: [2016-03-23 Wed 15:50]--[2016-03-23 Wed 16:26] =>  0:36
:END:
** 6.2.5 main
** 6.4
:LOGBOOK:
CLOCK: [2016-03-28 Mon 15:04]--[2016-03-28 Mon 16:21] =>  1:17
:END:
** 6.6 function matching

:LOGBOOK:
CLOCK: [2016-03-30 Wed 16:32]--[2016-03-30 Wed 17:14] =>  0:42
:END:
** 7.5 class
:LOGBOOK:
CLOCK: [2016-05-04 Wed 17:23]--[2016-05-04 Wed 18:23] =>  1:00
CLOCK: [2016-04-18 Mon 17:05]--[2016-04-18 Mon 18:05] =>  1:00
CLOCK: [2016-04-15 Fri 09:31]--[2016-04-15 Fri 11:31] =>  2:00
CLOCK: [2016-04-14 Thu 13:06]--[2016-04-14 Thu 14:56] =>  1:50
CLOCK: [2016-04-14 Thu 10:44]--[2016-04-14 Thu 11:24] =>  0:40
CLOCK: [2016-04-13 Wed 13:03]--[2016-04-13 Wed 13:57] =>  0:54
CLOCK: [2016-04-13 Wed 09:27]--[2016-04-13 Wed 11:43] =>  2:16
CLOCK: [2016-04-12 Tue 15:16]--[2016-04-12 Tue 16:19] =>  1:03
CLOCK: [2016-04-12 Tue 13:37]--[2016-04-12 Tue 14:04] =>  0:27
CLOCK: [2016-04-06 Wed 17:32]--[2016-04-06 Wed 18:32] =>  1:00
:END:
** TODO 8 the io library
** TODO study samg55 test method
 :LOGBOOK:
CLOCK: [2016-04-19 Tue 15:45]--[2016-04-19 Tue 16:45] =>  1:00
:END:




* TODO [#A] Learn SQL DATABASE
[2016-10-26 Wed] one hour
* TODO Learn CPP

** chapter 8

** chapter 9 operater overload skip first, read later

** chapter 12.2[2016-10-10 Mon] 

** chapter 13 [2016-10-12 Wed]
* Python study
#+BEGIN: clocktable :maxlevel 2 :scope subtree
#+CAPTION: Clock summary at [2016-04-07 Thu 10:31]
| Headline                               | Time    |      |
|----------------------------------------+---------+------|
| *Total time*                           | *15:49* |      |
|----------------------------------------+---------+------|
| Python study                           | 15:49   |      |
| \_  2060 dictionary                    |         | 0:20 |
| \_  2676 object oriented               |         | 0:19 |
| \_  2918 tuple                         |         | 0:12 |
| \_  python tutorial 1 - 2              |         | 2:54 |
| \_  python tutorial 3-4.7              |         | 2:34 |
| \_  4.7                                |         | 1:07 |
| \_  5.0                                |         | 1:18 |
| \_  5.3                                |         | 0:37 |
| \_  8.0                                |         | 1:08 |
| \_  9.3.3 classes                      |         | 1:47 |
| \_  10.7                               |         | 1:25 |
| \_  TODO review others codes in github |         | 2:08 |
#+END:

** 2060 dictionary
:LOGBOOK:
CLOCK: [2016-03-11 Fri 09:31]--[2016-03-11 Fri 09:51] =>  0:20
:END:
** 2676 object oriented
:LOGBOOK:
CLOCK: [2016-03-14 Mon 09:17]--[2016-03-14 Mon 09:36] =>  0:19
:END:
** 2918 tuple
:LOGBOOK:
CLOCK: [2016-03-15 Tue 09:17]--[2016-03-15 Tue 09:29] =>  0:12
:END:
** 3067 re
** python tutorial 1 - 2
:LOGBOOK:
CLOCK: [2016-03-16 Wed 13:12]--[2016-03-16 Wed 13:57] =>  0:45
CLOCK: [2016-03-16 Wed 09:22]--[2016-03-16 Wed 11:31] =>  2:09
:END:
** python tutorial 3-4.7

:LOGBOOK:
CLOCK: [2016-03-17 Thu 08:59]--[2016-03-17 Thu 11:33] =>  2:34
:END:
** 4.7
:LOGBOOK:
CLOCK: [2016-03-18 Fri 09:53]--[2016-03-18 Fri 11:00] =>  1:07
:END:
** 5.0
:LOGBOOK:
CLOCK: [2016-03-21 Mon 16:06]--[2016-03-21 Mon 17:24] =>  1:18
:END:
** 5.3
:LOGBOOK:
CLOCK: [2016-03-22 Tue 13:19]--[2016-03-22 Tue 13:56] =>  0:37
:END:
** 6.0 modules
** 7.0 
** IO
** 8.0
:LOGBOOK:
CLOCK: [2016-03-25 Fri 09:27]--[2016-03-25 Fri 10:35] =>  1:08
:END:
** 9.3.3 classes
:LOGBOOK:
CLOCK: [2016-03-28 Mon 09:23]--[2016-03-28 Mon 11:10] =>  1:47
:END:
** standard library
** 10.7
:LOGBOOK:
CLOCK: [2016-03-29 Tue 09:23]--[2016-03-29 Tue 10:48] =>  1:25
:END:
** 11.2 templating
** TODO review others codes in github
:LOGBOOK:
CLOCK: [2016-03-30 Wed 09:16]--[2016-03-30 Wed 11:24] =>  2:08
:END:
* Perl study modern perl
** DONE from page2
CLOSED: [2016-04-05 Tue 17:46]
** DONE from page14
CLOSED: [2016-04-12 Tue 11:35]
:LOGBOOK:
CLOCK: [2016-04-12 Tue 13:37]--[2016-04-12 Tue 13:37] =>  0:00
CLOCK: [2016-04-12 Tue 09:10]--[2016-04-12 Tue 11:34] =>  2:24
:END:
** TODO from page107 chapter7

:LOGBOOK:
CLOCK: [2016-05-05 Thu 13:57]--[2016-05-05 Thu 18:19] =>  4:22
CLOCK: [2016-05-05 Thu 10:45]--[2016-05-05 Thu 13:56] =>  3:11
CLOCK: [2016-05-04 Wed 16:44]--[2016-05-04 Wed 17:20] =>  0:36
CLOCK: [2016-04-19 Tue 13:09]--[2016-04-19 Tue 15:19] =>  2:10
CLOCK: [2016-04-19 Tue 09:49]--[2016-04-19 Tue 10:23] =>  0:34
CLOCK: [2016-04-14 Thu 15:18]--[2016-04-14 Thu 17:58] =>  2:40
CLOCK: [2016-04-13 Wed 13:58]--[2016-04-13 Wed 16:23] =>  2:25
:END:
** DONE [#B] perlmaven regexp
CLOSED: [2016-05-06 Fri 15:09]
:LOGBOOK:
CLOCK: [2016-05-04 Wed 16:00]--[2016-05-04 Wed 16:44] =>  0:44
CLOCK: [2016-04-20 Wed 09:39]--[2016-04-20 Wed 14:59] =>  5:20
:END:
** TODO programing perl 12.4.1 
* TODO [#A] Programming Perl English Edition 
** begin[2016-10-08 Sat] 
** Part1 overview PAGE 51
** Page74[2016-10-26 Wed]
** chapter3 Page139[2016-10-27 Thu]
** chaper4 Page173[2016-10-28 Fri]
** p239 The Regex Compile[2016-11-04 Fri] 
* TODO lean perl6 perl6intro.com 1.7.3
* TODO [#B] Java -www.weixueyuan.net-
** 4.3[2016-10-09 Sun] 
** 5.2[2016-10-10 Mon]
* SMARTEST firmware command and testmethod reference
** TODO firmware command 
:LOGBOOK:
CLOCK: [2016-03-18 Fri 14:24]--[2016-03-18 Fri 16:00] =>  1:36
:END:
Routing setup commands topic:13445
** TODO testmethod reference
* study smartRDI
* Org-MODE USAGE
  *bold*
  /italian/
  +delete line+
  H_2 O
  E=mc^2
  _under line_

   My favorite scenes are (in this order)
   1. The attack of the Rohirri
      m
   2. Eowyn's fight with the witch king
      1. this was already my favorite scene in the book
      2. I really like Miranda Otto.
   3. Peter Jackson being shot by Legolas
      1. on DVD only
         He makes a really funny face when it happens.
ORG-LIST-END-MARKER
   But in the end, no individual scenes matter but the film as a whole.
   Important actors in this film are:
   - Elijah Wood :: He plays Frodo
   - Sean Austin :: He plays Sam, Frodo's friend.  I still remember
     him very well from his role as Mikey Walsh in The Goonies.
ORG-LIST-END-MARKER


